JimKueneman/OpenLcbCLib/src/applications/dspic/OpenLcb_Basic_Node.X/main.c
    count++;

    if (count > 10) {

        count = 0;

        LED_BLUE = 0;
        LED_YELLOW = 0;
    }

}

void _can_rx_callback(can_msg_t* can_msg) {

    // Called when a CAN message is received

    //    printf("Rx: 0x%08lX [", can_msg->identifier);
    //    
    //    for (int i = 0; i < can_msg->payload_count; i++) {
    //        
    //        printf("0x%04X ", can_msg->payload[i]);
    //        
    //    }
    //    
    //    printf("]\n");

    LED_BLUE = 1;

}

void _can_tx_callback(can_msg_t* can_msg) {

    // Called when a CAN message is transmitted

    //    printf("Tx: 0x%08lX\n", can_msg->identifier);

    LED_YELLOW = 1;

}

void _alias_change_callback(uint16_t new_alias, node_id_t node_id) {

    printf("Alias Allocation: 0x%02X  ", new_alias);
    printf("NodeID: 0x%04X%04X%04X\n\n", (uint16_t) (node_id >> 32), (uint16_t) (node_id >> 16), (uint16_t) node_id);

}

void _event_with_payload(openlcb_node_t* node, event_id_t* event_id, uint16_t count, event_payload_t* payload) {

    //    printf("event with payload: data count = %d; Total count = %d\n", count, count + sizeof(*event_id));
    //    printf("event_id = 0x%08llX\n", *event_id);
    //    
    //    uint16_t i = 1;
    //    
    //    printf("[ ");
    //    while (i <= count) {
    //        
    //        if (i % 8 == 0) {
    //            
    //            printf("0x%02X ] ", (*payload)[i-1]);
    //            printf("\n");
    //            printf("[ ");
    //            
    //        } else {
    //
    //          printf("0x%02X, ", (*payload)[i-1]);
    //          
    //        }
    //          
    //        i++;
    //        
    //    }
    //
    //    printf("\n\n");

}

#define TRANSMIT_CAN_FRAME_FUNC &Ecan1Helper_transmit_can_frame
#define IS_TX_BUFFER_EMPTY_FUNC &Ecan1Helper_is_can_tx_buffer_clear
#define LOCK_SHARED_RESOURCES_FUNC &Ecan1Helper_pause_can_rx
#define UNLOCK_SHARED_RESOURCES_FUNC &Ecan1Helper_resume_can_rx
#define CONFIG_MEM_READ_FUNC &BasicNodeDrivers_config_mem_read

const interface_can_login_message_handler_t interface_can_login_message_handler = {

    .alias_mapping_register = &AliasMappings_register,
    .alias_mapping_find_mapping_by_alias = &AliasMappings_find_mapping_by_alias,
    // Callback events
    .on_alias_change = &_alias_change_callback

};

const interface_can_login_state_machine_t interface_can_login_state_machine = {

    .state_init = &CanLoginMessageHandler_state_init,
    .state_generate_seed = &CanLoginMessageHandler_state_generate_seed,
    .state_generate_alias = &CanLoginMessageHandler_state_generate_alias,
    .state_load_cid07 = &CanLoginMessageHandler_state_load_cid07,
    .state_load_cid06 = &CanLoginMessageHandler_state_load_cid06,
    .state_load_cid05 = &CanLoginMessageHandler_state_load_cid05,
    .state_load_cid04 = &CanLoginMessageHandler_state_load_cid04,
    .state_wait_200ms = &CanLoginMessageHandler_state_wait_200ms,
    .state_load_rid = &CanLoginMessageHandler_state_load_rid,
    .state_load_amd = &CanLoginMessageHandler_state_load_amd
            
};

const interface_can_rx_message_handler_t interface_can_rx_message_handler = {

    .openlcb_buffer_store_allocate_buffer = &OpenLcbBufferStore_allocate_buffer,
    .can_buffer_store_allocate_buffer = &CanBufferStore_allocate_buffer,
    .alias_mapping_find_mapping_by_alias = &AliasMappings_find_mapping_by_alias,
    .alias_mapping_find_mapping_by_node_id = &AliasMappings_find_mapping_by_node_id,
    .alias_mapping_get_alias_mapping_info = &AliasMappings_get_alias_mapping_info,
    .alias_mapping_set_has_duplicate_alias_flag = &AliasMappings_set_has_duplicate_alias_flag

};

const interface_can_rx_statemachine_t interface_can_rx_statemachine = {

    .handle_can_legacy_snip = &CanRxMessageHandler_can_legacy_snip,
    .handle_single_frame = &CanRxMessageHandler_single_frame,
    .handle_first_frame = &CanRxMessageHandler_first_frame,
    .handle_middle_frame = &CanRxMessageHandler_middle_frame,
    .handle_last_frame = &CanRxMessageHandler_last_frame,
    .handle_stream_frame = &CanRxMessageHandler_stream_frame,
    .handle_rid_frame = CanRxMessageHandler_rid_frame,
    .handle_amd_frame = CanRxMessageHandler_amd_frame,
    .handle_ame_frame = CanRxMessageHandler_ame_frame,
    .handle_amr_frame = CanRxMessageHandler_amr_frame,
    .handle_error_info_report_frame = CanRxMessageHandler_error_info_report_frame,
    .handle_cid_frame = CanRxMessageHandler_cid_frame,
    .alias_mapping_find_mapping_by_alias = &AliasMappings_find_mapping_by_alias,
    // Callback events
    .on_receive = &_can_rx_callback

};

const interface_can_tx_message_handler_t interface_can_tx_message_handler = {

    .transmit_can_frame = TRANSMIT_CAN_FRAME_FUNC, //  HARDWARE INTERFACE
    // Callback events
    .on_transmit = &_can_tx_callback

};

const interface_can_tx_statemachine_t interface_can_tx_statemachine = {

    .is_tx_buffer_empty = IS_TX_BUFFER_EMPTY_FUNC, //  HARDWARE INTERFACE
    .handle_addressed_msg_frame = &CanTxMessageHandler_addressed_msg_frame,
    .handle_unaddressed_msg_frame = &CanTxMessageHandler_unaddressed_msg_frame,
    .handle_datagram_frame = &CanTxMessageHandler_datagram_frame,
    .handle_stream_frame = &CanTxMessageHandler_stream_frame,
    .handle_can_frame = &CanTxMessageHandler_can_frame

};

const interface_can_main_statemachine_t interface_can_main_statemachine = {

    .lock_shared_resources = LOCK_SHARED_RESOURCES_FUNC, //  HARDWARE INTERFACE
    .unlock_shared_resources = UNLOCK_SHARED_RESOURCES_FUNC, //  HARDWARE INTERFACE
    .send_can_message = &CanTxStatemachine_send_can_message,
    .openlcb_node_get_first = &OpenLcbNode_get_first,
    .openlcb_node_get_next = &OpenLcbNode_get_next,
    .openlcb_node_find_by_alias = &OpenLcbNode_find_by_alias,
    .login_statemachine_run = &CanLoginStateMachine_run,
    .alias_mapping_get_alias_mapping_info = &AliasMappings_get_alias_mapping_info,
    .alias_mapping_unregister = &AliasMappings_unregister,

    .handle_duplicate_aliases = &CanMainStatemachine_handle_duplicate_aliases,
    .handle_outgoing_can_message = &CanMainStatemachine_handle_outgoing_can_message,
    .handle_login_outgoing_can_message = &CanMainStatemachine_handle_login_outgoing_can_message,
    .handle_try_enumerate_first_node = &CanMainStatemachine_handle_try_enumerate_first_node,
    .handle_try_enumerate_next_node = &CanMainStatemachine_handle_try_enumerate_next_node

