JimKueneman/OpenLcbCLib/src/applications/dspic/OpenLcb_Basic_Node.X/main.c
};

const interface_openlcb_protocol_snip_t interface_openlcb_protocol_snip = {

    .configuration_memory_read = CONFIG_MEM_READ_FUNC

};

// TODO Finish these interfaces
// -------------------------------

const interface_protocol_datagram_handler_t interface_protocol_datagram_handler = {

    // Memory Read Address Space
    .memory_read_space_config_description_info_message = NULL,
    .memory_read_space_all_message = NULL,
    .memory_read_space_configuration_memory_message = NULL,
    .memory_read_space_acdi_manufacturer_message = NULL,
    .memory_read_space_acdi_user_message = NULL,
    .memory_read_space_traction_function_definition_info_message = NULL,
    .memory_read_space_traction_function_config_memory_message = NULL,

    // Memory Read Ok Ok Address Space
    .memory_read_space_config_description_info_reply_ok_message = NULL,
    .memory_read_space_all_reply_ok_message = NULL,
    .memory_read_space_configuration_memory_reply_ok_message = NULL,
    .memory_read_space_acdi_manufacturer_reply_ok_message = NULL,
    .memory_read_space_acdi_user_reply_ok_message = NULL,
    .memory_read_space_traction_function_definition_info_reply_ok_message = NULL,
    .memory_read_space_traction_function_config_memory_reply_ok_message = NULL,

    // Memory Read Failed Reply Address Space
    .memory_read_space_config_description_info_reply_fail_message = NULL,
    .memory_read_space_all_reply_fail_message = NULL,
    .memory_read_space_configuration_memory_reply_fail_message = NULL,
    .memory_read_space_acdi_manufacturer_reply_fail_message = NULL,
    .memory_read_space_acdi_user_reply_fail_message = NULL,
    .memory_read_space_traction_function_definition_info_reply_fail_message = NULL,
    .memory_read_space_traction_function_config_memory_reply_fail_message = NULL,

    // Memory Write Address Space
    .memory_write_space_config_description_info_message = NULL,
    .memory_write_space_all_message = NULL,
    .memory_write_space_configuration_memory_message = NULL,
    .memory_write_space_acdi_manufacturer_message = NULL,
    .memory_write_space_acdi_user_message = NULL,
    .memory_write_space_traction_function_definition_info_message = NULL,
    .memory_write_space_traction_function_config_memory_message = NULL,
    .memory_write_space_firmware_upgrade_message = NULL,

    // Memory Write Ok Reply Address Space
    .memory_write_space_config_description_info_reply_ok_message = NULL,
    .memory_write_space_all_reply_ok_message = NULL,
    .memory_write_space_configuration_memory_reply_ok_message = NULL,
    .memory_write_space_acdi_manufacturer_reply_ok_message = NULL,
    .memory_write_space_acdi_user_reply_ok_message = NULL,
    .memory_write_space_traction_function_definition_info_reply_ok_message = NULL,
    .memory_write_space_traction_function_config_memory_reply_ok_message = NULL,

    // Memory Write Fail Reply Address Space
    .memory_write_space_config_description_info_reply_fail_message = NULL,
    .memory_write_space_all_reply_fail_message = NULL,
    .memory_write_space_configuration_memory_reply_fail_message = NULL,
    .memory_write_space_acdi_manufacturer_reply_fail_message = NULL,
    .memory_write_space_acdi_user_reply_fail_message = NULL,
    .memory_write_space_traction_function_definition_info_reply_fail_message = NULL,
    .memory_write_space_traction_function_config_memory_reply_fail_message = NULL,

    // Memory Write Under Mask Address Space
    .memory_write_under_mask_space_config_description_info_message = NULL,
    .memory_write_under_mask_space_all_message = NULL,
    .memory_write_under_mask_space_configuration_memory_message = NULL,
    .memory_write_under_mask_space_acdi_manufacturer_message = NULL,
    .memory_write_under_mask_space_acdi_user_message = NULL,
    .memory_write_under_mask_space_traction_function_definition_info_message = NULL,
    .memory_write_under_mask_space_traction_function_config_memory_message = NULL,
    .memory_write_under_mask_space_firmware_upgrade_message = NULL,

    // Commands
    .memory_options_cmd_message = NULL,
    .memory_options_reply_message = NULL,
    .memory_get_address_space_info_message = NULL,
    .memory_get_address_space_info_reply_not_present_message = NULL,
    .memory_get_address_space_info_reply_present_message = NULL,
    .memory_reserve_lock_message = NULL,
    .memory_get_unique_id_message = NULL,
    .memory_unfreeze_message = NULL,
    .memory_freeze_message = NULL,
    .memory_update_complete_message = NULL,
    .memory_reset_reboot_message = NULL,
    .memory_factory_reset_message = NULL,
    .send_datagram_rejected_reply = NULL

};

const interface_openlcb_application_t interface_openlcb_application = {

    .transmit_openlcb_message = NULL,
    .configuration_memory_read = NULL,
    .configuration_memory_write = NULL

};

interface_openlcb_protocol_datagram_config_mem_handler_t interface_openlcb_protocol_datagram_config_mem_handler = {

    .configuration_memory_read = NULL,
    .configuration_memory_write = NULL,
    .reboot = NULL,
    .configuration_memory_factory_reset = NULL,
    .snip_load_manufacturer_version_id = NULL,
    .snip_load_name = NULL,
    .snip_load_model = NULL,
    .snip_load_hardware_version = NULL,
    .snip_load_software_version = NULL,
    .snip_load_user_version_id = NULL,
    .snip_load_user_name = NULL,
    .snip_load_user_description = NULL,
    // Callback events
    .on_configuration_memory_factory_reset = NULL,
    .on_config_mem_write = NULL,
    .on_config_mem_freeze_firmware_update = NULL,
    .on_config_mem_unfreeze_firmware_update = NULL

};

void _initialize_io_early_for_test(void) {


    ANSELA = 0x00; // Convert all I/O pins to digital
    ANSELB = 0x00;
    ANSELC = 0x00;
    ANSELE = 0x00;


    LED_BLUE_TRIS = 0;
    LED_GREEN_TRIS = 0;
    LED_YELLOW_TRIS = 0;

    TEST_PIN_1401_TRIS = 0;
    TEST_PIN_1402_TRIS = 0;
    TEST_PIN_1403_TRIS = 0;
    TEST_PIN_1404_TRIS = 0;

}

int main(void) {

    _initialize_io_early_for_test();

    Ecan1Helper_initialize();
    BasicNodeDrivers_initialize();

    printf("MCU Initialized\n");

    CanBufferStore_initialize();
    CanBufferFifo_initialize();

    CanRxMessageHandler_initialize(&interface_can_rx_message_handler);
    CanRxStatemachine_initialize(&interface_can_rx_statemachine);

    CanTxMessageHandler_initialize(&interface_can_tx_message_handler);
    CanTxStatemachine_initialize(&interface_can_tx_statemachine);

    CanLoginMessageHandler_initialize(&interface_can_login_message_handler);
    CanLoginStateMachine_initialize(&interface_can_login_state_machine);
    CanMainStatemachine_initialize(&interface_can_main_statemachine);

    AliasMappings_initialize();

    OpenLcbBufferStore_initialize();
    OpenLcbBufferList_initialize();
    OpenLcbBufferFifo_initialize();

    ProtocolSnip_initialize(&interface_openlcb_protocol_snip);
    ProtocolDatagramConfigMemHandler_initialize(&interface_openlcb_protocol_datagram_config_mem_handler);
    ProtocolDatagramHandler_initialize(&interface_protocol_datagram_handler);
    ProtocolEventTransport_initialize(&interface_openlcb_protocol_event_transport);
    ProtocolMessageNetwork_initialize(&interface_openlcb_protocol_message_network);

    OpenLcbNode_initialize(&interface_openlcb_node);

    OpenLcbLoginMessageHandler_initialize(&interface_openlcb_login_message_handler);
    OpenLcbLoginStateMachine_initialize(&interface_openlcb_login_state_machine);
    OpenLcbMainStatemachine_initialize(&interface_openlcb_main_statemachine);

    OpenLcbApplication_initialize(&interface_openlcb_application);

    // We always boot and reallocate the alias
    openlcb_node_t* node = OpenLcbNode_allocate(0x050101010707, &NodeParameters_main_node);

    printf("Does it work?\n");

    while (1) {

        // Run the main Openlcb/LCC engine
        CanMainStateMachine_run();
        OpenLcbMainStatemachine_run();

    }
}
